Ran Plan for dir: `ec2` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.public_es[0] must be replaced
-/+ resource "aws_instance" "public_es" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0cf7be8eb746125f3" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1c" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0cf7be8eb746125f3" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-08056d4a047743632" -> (known after apply)
      ~ private_dns                          = "ip-192-168-2-43.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "192.168.2.43" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "18.141.206.35" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "node-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "c7b352bd2025d7d15054a1d5e289771e310dc732" -> "75010996da219eb5e39b6287e2c817c840df7a05" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0514c30e56d7bec4f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es[1] must be replaced
-/+ resource "aws_instance" "public_es" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-078dd28271d22e984" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-078dd28271d22e984" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-07b88e37c90649cc6" -> (known after apply)
      ~ private_dns                          = "ip-192-168-0-120.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "192.168.0.120" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "52.77.209.77" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "node-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "c7b352bd2025d7d15054a1d5e289771e310dc732" -> "75010996da219eb5e39b6287e2c817c840df7a05" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0c7da7768f5357e09" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.public_es[2] must be replaced
-/+ resource "aws_instance" "public_es" {
      ~ arn                                  = "arn:aws:ec2:ap-southeast-1:767397904461:instance/i-0366441aae0f0f2cd" -> (known after apply)
      ~ availability_zone                    = "ap-southeast-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0366441aae0f0f2cd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0f7b41730e2ddd12c" -> (known after apply)
      ~ private_dns                          = "ip-192-168-1-36.ap-southeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "192.168.1.36" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "54.169.124.33" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Name" = "node-3"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "c7b352bd2025d7d15054a1d5e289771e310dc732" -> "75010996da219eb5e39b6287e2c817c840df7a05" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d914d4a5336e2563" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d ec2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://a3235ad69b8a:4141/lock?id=tampubolon%252Felasticsearch-lab%252Fec2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d ec2`
</details>
Plan: 3 to add, 0 to change, 3 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`